todo/README.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2018-03-23 Fri 00:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Duong Tran">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>TODO 1: Wrap whole code inside resources/js/main.js inside a IIFE to protect its scope
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>TODO 2: Complete the callback function for click event of add button: when user click on the addButton if there is any text inside item input field, then we invoke the addItem function with the value of item input as its argument
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>TODO 3: Complete callback function for keydown event of item input: when user press down a key and that key is Enter and there     var data = localStorage.getItem('todoData');
return data ? JSON.parse(data) : initialData;
</li>
</ul>
<p>
is any text inside item input, then we invoke the addItem function with the value of item input as its argument
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>TODO 4: Complete addItem function: clear input value of itemInput
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>TODO 5: Add liItem to todoList
</li>
<li>Test if you do it correctly, you should be able to add item to todoList by now
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>TODO 6: Complete toggleCompleteItem function, so that when user click on completeButton, it will toggle 'completed' class for liItem
</li>
<li>You should see that the style of liItem change if you do it correctly
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>TODO 7: complete removeItem function, so that when user click on removeButton the clicked liItem will be removed from todoList 
</li>
<li>You should have a working version of todo app now
</li>
<li>Now try adding some item to todoList and refesh the page. Do you notice something wrong ?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <span class="label label-primary TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>TODO 8: Use localStorage to storage and retrieve todo items so that even when browser refresh the todo list is still the same;
</li>
<li>Hint: update our code where you find // TODO 8
</li>
</ul>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. </a></li>
<li><a href="#sec-3">3. </a></li>
<li><a href="#sec-4">4. </a></li>
<li><a href="#sec-5">5. </a></li>
<li><a href="#sec-6">6. </a></li>
<li><a href="#sec-7">7. </a></li>
<li><a href="#sec-8">8. </a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Duong Tran</p>
<p class="date">Created: 2018-03-23 Fri 00:09</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.7)</p>
</div>
</footer>
</body>
</html>
